In [2]:
import numpy as np
import pandas as pd

In [6]:
left1 = pd.DataFrame({"key": ["a", "b", "a", "a", "b", "c"],
                    "value": pd.Series(range(6), dtype="Int64")})

In [7]:
right1 = pd.DataFrame({"group_val": [3.5, 7]}, index=["a", "b"])

In [9]:
pd.merge(left1, right1, left_on="key", right_index=True, how="outer")

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [10]:
lefth = pd.DataFrame({"key1": ["Ohio", "Ohio", "Ohio",
                              "Nevada", "Nevada"],
                     "key2": [2000, 2001, 2002, 2001, 2002],
                     "data": pd.Series(range(5), dtype="Int64")})

In [12]:
right_index = pd.MultiIndex.from_arrays(
[
    ["Nevada", "Nevada", "Ohio", "Ohio", "Ohio", "Ohio"],
    [2001, 2000, 2000, 2000, 2001, 2002]
]
)

In [15]:
right = pd.DataFrame({"event1": pd.Series([0, 2, 4, 6, 8, 10], dtype="Int64", index=right_index),
                     "event2": pd.Series([1, 3, 5, 7, 9, 11], dtype="Int64", index=right_index)})

In [13]:
lefth

     key1  key2  data
0    Ohio  2000     0
1    Ohio  2001     1
2    Ohio  2002     2
3  Nevada  2001     3
4  Nevada  2002     4

In [16]:
pd.merge(lefth, right, left_on=["key1", "key2"], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000     0       4       5
0    Ohio  2000     0       6       7
1    Ohio  2001     1       8       9
2    Ohio  2002     2      10      11
3  Nevada  2001     3       0       1

In [17]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                    index=["a", "c", "e"],
                    columns=["Ohio", "Nevada"]).astype("Int64")

In [18]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                     index=["b", "c", "d", "e"],
                     columns=["Missouri", "Alabama"]).astype("Int64")

In [19]:
left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [20]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [21]:
pd.merge(left2, right2, how="outer", left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a     1       2      <NA>     <NA>
b  <NA>    <NA>         7        8
c     3       4         9       10
d  <NA>    <NA>        11       12
e     5       6        13       14

In [22]:
left2.join(right2, how="outer")

   Ohio  Nevada  Missouri  Alabama
a     1       2      <NA>     <NA>
b  <NA>    <NA>         7        8
c     3       4         9       10
d  <NA>    <NA>        11       12
e     5       6        13       14

In [23]:
left1.join(right1, on="key")

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [25]:
another = pd.DataFrame([[7., 8.], [9., 10,], [11., 12], [16., 17.]],
                       index=["a", "c", "e", "f"],
                       columns=["New York", "Oregon"])

In [26]:
arr = np.arange(12).reshape((3, 4))

In [27]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [30]:
arr1 = np.arange(12).reshape((3, 4))

In [31]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [32]:
s1 = pd.Series([0, 1], index=["a", "b"], dtype="Int64")

In [33]:
s2 = pd.Series([2, 3, 4], index=["c", "d", "e"], dtype="Int64")

In [34]:
s3 = pd.Series([5, 6], index=["f", "g"], dtype="Int64")

In [35]:
s1

a    0
b    1
dtype: Int64

In [36]:
s2

c    2
d    3
e    4
dtype: Int64

In [37]:
s3

f    5
g    6
dtype: Int64

In [39]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: Int64

In [40]:
pd.concat([s1, s2, s3], axis="columns")

      0     1     2
a     0  <NA>  <NA>
b     1  <NA>  <NA>
c  <NA>     2  <NA>
d  <NA>     3  <NA>
e  <NA>     4  <NA>
f  <NA>  <NA>     5
g  <NA>  <NA>     6